app/views/photos/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`photo_id` = 10
---
        <pre><strong>Comments:</strong>
        <% @photo.comments.each do |comment| %>