app/controllers/albums_controller.rb

INSERT INTO `albums` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-01-29 13:51:30', 'test123', 'Ramans', '2013-01-29 13:51:30')
---
	def create
		@album = Album.new(params[:album])
		@album.save

SELECT `albums`.* FROM `albums`
---
	def index
		@albums = Album.all

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
---
	def show
		@album = Album.find_by_id(params[:id])