app/controllers/photos_controller.rb

	def index
		@photos = Photo.all
---
SELECT `photos`.* FROM `photos`

	def create
		@photo = Photo.new(params[:photo])
		@photo.save
---
INSERT INTO `photos` (`album_id`, `created_at`, `description`, `name`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `updated_at`) VALUES (NULL, '2013-01-29 14:13:57', 'hghgjhj', 'Ramans', 'image/jpeg', 'sun.jpg', 2809711, '2013-01-29 14:13:57')

	def show
		@photo = Photo.find_by_id(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` IS NULL LIMIT 1

	def edit
		@photo = Photo.find_by_id(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1

	def update
		@photo = Photo.find_by_id(params[:id])
		if @photo.update_attributes(params[:photo])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1
UPDATE `photos` SET `photo_file_name` = 'Raman_-pp.JPG', `photo_content_type` = 'image/jpeg', `photo_file_size` = 70513, `updated_at` = '2013-01-28 03:41:08' WHERE `photos`.`id` = 8

	def destroy
		@photo = Photo.find_by_id(params[:id])
		@photo.destroy
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 12 LIMIT 1
DELETE FROM `photos` WHERE `photos`.`id` = 12